### Total: 7 = COMPLETE - all international events where medalist competed


2016
- 5

2020
- 2

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('bb_w.csv')

In [3]:
df[df['year']==2021]

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round
1539,1.0,Mélanie De Jesus Dos Santos,FRA,6.0,7.900,0.0,13.900,2021,final
1540,2.0,Sanne Wevers,NED,5.6,8.266,0.0,13.866,2021,final
1541,3.0,Anastasiia Bachynska,UKR,5.6,7.733,0.0,13.333,2021,final
1542,4.0,Amelie Morgan,GBR,5.3,7.866,0.0,13.166,2021,final
1543,5.0,Martina Maggio,ITA,4.9,8.100,0.0,13.000,2021,final
...,...,...,...,...,...,...,...,...,...
1737,83.0,Greta Banishka,BUL,4.1,4.700,NaN,8.800,2021,qual
1738,84.0,Thea Nygaard,NOR,4.7,4.100,NaN,8.800,2021,qual
1739,85.0,Victoria Kajø,DEN,4.3,4.000,NaN,8.300,2021,qual
1740,86.0,Linda Tugarinova,LAT,3.7,4.533,NaN,8.233,2021,qual
1741,87.0,Marina Nekrasova,AZE,1.6,7.666,-6.5,2.766,2021,qual

In [4]:
# sanne wevers

# 2016
1. sanne wevers (NED) - 1 competition for bb
2. laurie hernandez (USA) - no competition for bb
3. simone biles (USA) - competitions 


# 2020
1. guan chenchen (CHN) - only competition is olympics
2. tang xijing (CHN) - only competition was wc in 2019 but iaa 2019 
3. simone biles (USA) - 1 competition b/w 2017-2020

In [5]:
df['Name'] = df['Name'].str.lower()

In [6]:
df12 = df[df['year'].isin([2011])].copy()
df16 = df[df['year'].isin([2013, 2014, 2015, 2016])].copy()
df20 = df[df['year'].isin([2017, 2018, 2019, 2020, 2021])].copy()
df24 = df[df['year'].isin([2022, 2023])].copy()

In [7]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'sanne wevers':
        return 3
    elif name_lower == 'laurie hernandez':
        return 2
    elif name_lower == 'simone biles':
        return 1
    else:
        return -1

# Apply the function to create the "medal" column
df16['medal'] = df16['Name'].apply(assign_medal)

In [8]:
# # Define a function to assign medal values based on the "Name" column
# def assign_medal(name):
#     name_lower = name.lower()
#     if name_lower == 'sanne wevers':
#         return 1
#     elif name_lower == 'laurie hernandez':
#         return 1
#     elif name_lower == 'simone biles':
#         return 1
#     else:
#         return 0

# # Apply the function to create the "medal" column
# df16['medal'] = df16['Name'].apply(assign_medal)

In [9]:
df16[df16['Name']=='simone biles']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
36,1.0,simone biles,USA,6.5,8.750,0.0,15.250,2015,final,1
159,3.0,simone biles,USA,6.1,8.233,0.0,14.333,2013,final,1
165,1.0,simone biles,USA,6.4,8.700,0.0,15.100,2014,final,1
173,1.0,simone biles,USA,6.4,8.958,0.0,15.358,2015,final,1

In [10]:

df16[df16['Name']=='laurie hernandez']

Empty DataFrame
Columns: [Rank, Name, nation, D Score, E Score, Pen., Total, year, round, medal]
Index: []

In [11]:
df16[df16['Name']=='sanne wevers']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
174,2.0,sanne wevers,NED,5.7,8.633,0.0,14.333,2015,final,3
1839,8.0,sanne wevers,NED,5.3,6.700,-0.1,11.900,2015,final,3
1844,5.0,sanne wevers,NED,5.7,8.625,-0.1,14.225,2015,qual,3

In [12]:
df16['medal'].value_counts()

medal
-1    227
 1      4
 3      3
Name: count, dtype: int64

In [13]:
# Define a function to assign medal values based on the "Name" column
def assign_medal(name):
    name_lower = name.lower()
    if name_lower == 'guan chenchen':
        return 3
    elif name_lower == 'tang xijing ':
        return 2
    elif name_lower == 'simone biles':
        return 1
    else:
        return -1

# Apply the function to create the "medal" column
df20['medal'] = df20['Name'].apply(assign_medal)

In [14]:
# # Define a function to assign medal values based on the "Name" column
# def assign_medal(name):
#     name_lower = name.lower()
#     if name_lower == 'guan chenchen':
#         return 1
#     elif name_lower == 'tang xijing ':
#         return 1
#     elif name_lower == 'simone biles':
#         return 1
#     else:
#         return 0

# # Apply the function to create the "medal" column
# df20['medal'] = df20['Name'].apply(assign_medal)

In [15]:
df20[df20['Name']=='simone biles']

,Rank,Name,nation,D Score,E Score,Pen.,Total,year,round,medal
191,3.0,simone biles,NaN,6.2,7.400,0.0,13.600,2018,final,1
197,1.0,simone biles,NaN,6.4,8.666,0.0,15.066,2019,final,1

In [16]:
df20['medal'].value_counts()

medal
-1    351
 1      2
Name: count, dtype: int64

In [17]:
combined_df = pd.concat([df20, df16], axis=0)
df = combined_df.copy()

In [18]:
df['medal'].value_counts()

medal
-1    578
 1      6
 3      3
Name: count, dtype: int64

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 587 entries, 0 to 1928
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     587 non-null    float64
 1   Name     587 non-null    object
 2   nation   563 non-null    object
 3   D Score  587 non-null    float64
 4   E Score  587 non-null    float64
 5   Pen.     422 non-null    float64
 6   Total    587 non-null    float64
 7   year     587 non-null    int64
 8   round    587 non-null    object
 9   medal    587 non-null    int64
dtypes: float64(5), int64(2), object(3)
memory usage: 50.4+ KB

In [20]:
df['Pen.'].fillna(0, inplace=True)

In [21]:
df.nunique()

Rank       100
Name       377
nation      62
D Score     36
E Score    179
Pen.         7
Total      222
year         9
round        4
medal        3
dtype: int64

In [22]:
df['round'] = df['round'].str.lower()

In [23]:
from sklearn.preprocessing import LabelEncoder

# Assuming df is your DataFrame and 'Name' is the column you want to encode
le = LabelEncoder()

# Fit and transform the 'Name' column to create integer labels
df['Name_encoded'] = le.fit_transform(df['Name'])

# Store the mapping between integers and original objects
label_mapping = dict(zip(le.transform(df['Name']), df['Name']))

# To revert the integers back to objects, use the label_mapping
# reverted_names = df['Name_encoded'].map(label_mapping)

In [24]:
df=df.drop(columns=["Name"])
df.rename(columns={'Name_encoded': 'Name'}, inplace=True)

In [25]:
from sklearn.preprocessing import LabelEncoder

# Assuming df is your DataFrame and 'Name' is the column you want to encode
le = LabelEncoder()

# Fit and transform the 'Name' column to create integer labels
df['nation_encoded'] = le.fit_transform(df['nation'])

# Store the mapping between integers and original objects
label_mapping_nation = dict(zip(le.transform(df['nation']), df['nation']))

# To revert the integers back to objects, use the label_mapping
# reverted_names = df['Name_encoded'].map(label_mapping)

In [26]:
df=df.drop(columns=["nation"])
df.rename(columns={'nation_encoded': 'nation'}, inplace=True)

In [27]:
df_encoded = pd.get_dummies(df, columns=['round'], prefix='round')

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 587 entries, 0 to 1928
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     587 non-null    float64
 1   D Score  587 non-null    float64
 2   E Score  587 non-null    float64
 3   Pen.     587 non-null    float64
 4   Total    587 non-null    float64
 5   year     587 non-null    int64
 6   round    587 non-null    object
 7   medal    587 non-null    int64
 8   Name     587 non-null    int64
 9   nation   587 non-null    int64
dtypes: float64(5), int64(4), object(1)
memory usage: 50.4+ KB

In [28]:
correlations = df_encoded.corrwith(df['medal'])

correlations.sort_values(ascending=False)

medal          1.000000
D Score        0.158194
Total          0.152399
round_final    0.142989
Name           0.142171
E Score        0.130515
nation         0.111775
Pen.           0.001471
year          -0.102853
Rank          -0.104791
round_qual    -0.142989
dtype: float64

In [29]:
# medal          1.000000
# D Score        0.193607
# Total          0.179708
# round_final    0.167159
# Name           0.153381
# E Score        0.148220
# nation         0.139464
# Pen.           0.004813
# year          -0.104411
# Rank          -0.113829
# round_qual    -0.167159
# dtype: float64

In [30]:
# medal          1.000000
# D Score        0.132512
# Total          0.131206
# Name           0.129836
# round_final    0.123862
# E Score        0.115328
# nation         0.092239
# Pen.          -0.000338
# Rank          -0.095295
# year          -0.097345
# round_qual    -0.123862
# dtype: float64